Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_flash.c
/*
 * Copyright 2017 - 2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_flash.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.flash"
#endif

/*!
 * @name Misc utility defines
 * @{
 */
/*! @brief Alignment utility. */
#ifndef ALIGN_DOWN
#define ALIGN_DOWN(x, a) (((uint32_t)(x)) & ~((uint32_t)(a)-1u))
#endif
#ifndef ALIGN_UP
#define ALIGN_UP(x, a) ALIGN_DOWN((uint32_t)(x) + (uint32_t)(a)-1u, a)
#endif

/*! @brief Join bytes to word utility. */
#define B1P2(b)                      (((uint32_t)(b)&0xFFU) << 8U)
#define B1P1(b)                      ((uint32_t)(b)&0xFFU)
#define B2P1(b)                      ((uint32_t)(b)&0xFFFFU)
#define BYTES_JOIN_TO_WORD_1_1(x, y) (B1P1(x) | B1P2(y))
#define BYTES_JOIN_TO_WORD_1_2(x, y) (B1P2(x) | B2P1(y))
/*@}*/

/*!
 * @name Secondary flash configuration
 * @{
 */
/*! @brief Indicates whether the secondary flash has its own protection register
 * in flash module. */
#define FLASH_SSD_SECONDARY_FLASH_HAS_ITS_OWN_PROTECTION_REGISTER (0)
/*@}*/

/*!
 * @name Flash cache ands speculation control defines
 * @{
 */
#if defined(MCM_PLACR_CFCC_MASK) || defined(MCM_CPCR2_CCBC_MASK)
#define FLASH_CACHE_IS_CONTROLLED_BY_MCM (1U)
#else
#define FLASH_CACHE_IS_CONTROLLED_BY_MCM (0U)
#endif
#if defined(FMC_PFB0CR_CINV_WAY_MASK) || defined(FMC_PFB01CR_CINV_WAY_MASK)
#define FLASH_CACHE_IS_CONTROLLED_BY_FMC (1U)
#else
#define FLASH_CACHE_IS_CONTROLLED_BY_FMC (0U)
#endif
#if defined(MCM_PLACR_DFCS_MASK)
#define FLASH_PREFETCH_SPECULATION_IS_CONTROLLED_BY_MCM (1U)
#else
#define FLASH_PREFETCH_SPECULATION_IS_CONTROLLED_BY_MCM (0U)
#endif
#if defined(FMC_PFB0CR_S_INV_MASK) || defined(FMC_PFB0CR_S_B_INV_MASK) || defined(FMC_PFB01CR_S_INV_MASK) || \
    defined(FMC_PFB01CR_S_B_INV_MASK)
#define FLASH_PREFETCH_SPECULATION_IS_CONTROLLED_BY_FMC (1U)
#else
#define FLASH_PREFETCH_SPECULATION_IS_CONTROLLED_BY_FMC (0U)
#endif
/*@}*/

/*!
 * @name Reserved EEPROM size (For a variety of purposes) defines
 * @{
 */
#define NVM_EEPROM_SIZE_FOR_EEESIZE_RESERVED 0x100UL
/*@}*/

/*!
 * @name Flash Program Once Field defines
 * @{
 */
#if defined(FSL_FEATURE_FLASH_IS_FTMRE) || defined(FSL_FEATURE_FLASH_IS_FTMRH)
/* FTMRE and FTMRH only support 8-bytes unit size */
#define FLASH_PROGRAM_ONCE_IS_4BYTES_UNIT_SUPPORT 0U
#define FLASH_PROGRAM_ONCE_IS_8BYTES_UNIT_SUPPORT 1U
#endif
/*@}*/

/*!
 * @name Flash security status defines
 * @{
 */
#define FLASH_SECURITY_STATE_KEYEN     0x80U
#define FLASH_SECURITY_STATE_UNSECURED 0x02U
#define FLASH_NOT_SECURE               0x01U
#define FLASH_SECURE_BACKDOOR_ENABLED  0x02U
#define FLASH_SECURE_BACKDOOR_DISABLED 0x04U
/*@}*/

/*!
 * @name Flash controller command numbers
 * @{
 */
#define FTMRx_ERASE_VERIFY_ALL_BLOCK      0x01U /*!< ERSVERALL*/
#define FTMRx_ERASE_VERIFY_BLOCK          0x02U /*!< ERSVERBLK*/
#define FTMRx_ERASE_VERIFY_SECTION        0x03U /*!< ERSVERSECT*/
#define FTMRx_READ_ONCE                   0x04U /*!< RDONCE or RDINDEX*/
#define FTMRx_PROGRAM                     0x06U /*!< PGM*/
#define FTMRx_PROGRAM_ONCE                0x07U /*!< PGMONCE or PGMINDEX*/
#define FTMRx_ERASE_ALL_BLOCK             0x08U /*!< ERSALL*/
#define FTMRx_ERASE_BLOCK                 0x09U /*!< ERSBLK*/
#define FTMRx_ERASE_SECTOR                0x0AU /*!< ERSSCR*/
#define FTMRx_ERASE_ALL_BLOCK_UNSECURE    0x0BU /*!< ERSALLU*/
#define FTMRx_SECURITY_BY_PASS            0x0CU /*!< VFYKEY*/
#define FTMRx_SET_USER_MARGIN_LEVEL       0x0DU /*!< SETUSERLVL*/
#define FTMRx_SET_FACTORY_MARGIN_LEVEL    0x0EU /*!< SETFTYLVL*/
#define FTMRx_CONFIGURE_NVM               0x0FU /*!< CONNVM*/
#define FTMRx_ERASE_VERIFY_EEPROM_SECTION 0x10U /*!< ERSVES*/
#define FTMRx_PROGRAM_EEPROM              0x11U /*!< PGME*/
#define FTMRx_ERASE_EEPROM_SECTOR         0x12U /*!< ERSESCR*/
                                                /*@}*/

/*!
 * @name Common flash register info defines
 * @{
 */
#if defined(FTMRE)
#define FTMRx                      FTMRE
#define FTMRx_BASE                 FTMRE_BASE
#define FTMRx_FCCOBIX_CCOBIX(x)    FTMRE_FCCOBIX_CCOBIX(x)
#define FTMRx_FCCOBLO_CCOB(x)      FTMRE_FCCOBLO_CCOB(x)
#define FTMRx_FCCOBHI_CCOB(x)      FTMRE_FCCOBHI_CCOB(x)
#define FTMRx_FCLKDIV_FDIVLCK_MASK FTMRE_FCLKDIV_FDIVLCK_MASK
#define FTMRx_FCLKDIV_FDIVLD_MASK  FTMRE_FCLKDIV_FDIVLD_MASK
#define FTMRx_FCLKDIV_FDIV_MASK    FTMRE_FCLKDIV_FDIV_MASK
#define FTMRx_FSTAT_CCIF_MASK      FTMRE_FSTAT_CCIF_MASK
#define FTMRx_FCLKDIV_FDIV(x)      FTMRE_FCLKDIV_FDIV(x)
#define FTMRx_FSTAT_ACCERR_MASK    FTMRE_FSTAT_ACCERR_MASK
#define FTMRx_FSTAT_FPVIOL_MASK    FTMRE_FSTAT_FPVIOL_MASK
#define FTMRx_FSTAT_MGBUSY_MASK    FTMRE_FSTAT_MGBUSY_MASK
#define FTMRx_FSTAT_MGSTAT_MASK    FTMRE_FSTAT_MGSTAT_MASK
#define FTMRx_FSTAT_MGSTAT0_MASK   FTMRE_FSTAT_MGSTAT(1)
#define FTMRx_FSTAT_MGSTAT1_MASK   FTMRE_FSTAT_MGSTAT(2)
#define FTMRx_FSEC_SEC_MASK        FTMRE_FSEC_SEC_MASK
#define FTMRx_FSEC_KEYEN_MASK      FTMRE_FSEC_KEYEN_MASK
#if defined(FTMRE_FPROT_FPHDIS_MASK)
#define FTMRx_FPROT_FPHDIS_MASK FTMRE_FPROT_FPHDIS_MASK
#endif
#if defined(FTMRE_FERSTAT_SFDIF_MASK)
#define FTMRx_FERSTAT_SFDIF_MASK FTMRE_FERSTAT_SFDIF_MASK
#define FTMRx_FERSTAT_DFDIF_MASK FTMRE_FERSTAT_DFDIF_MASK
#endif
#elif defined(FTMRH)
#define FTMRx                      FTMRH
#define FTMRx_BASE                 FTMRH_BASE
#define FTMRx_FCCOBIX_CCOBIX(x)    FTMRH_FCCOBIX_CCOBIX(x)
#define FTMRx_FCCOBLO_CCOB(x)      FTMRH_FCCOBLO_CCOB(x)
#define FTMRx_FCCOBHI_CCOB(x)      FTMRH_FCCOBHI_CCOB(x)
#define FTMRx_FCLKDIV_FDIVLCK_MASK FTMRH_FCLKDIV_FDIVLCK_MASK
#define FTMRx_FCLKDIV_FDIVLD_MASK  FTMRH_FCLKDIV_FDIVLD_MASK
#define FTMRx_FCLKDIV_FDIV_MASK    FTMRH_FCLKDIV_FDIV_MASK
#define FTMRx_FCLKDIV_FDIV(x)      FTMRH_FCLKDIV_FDIV(x)
#define FTMRx_FSTAT_CCIF_MASK      FTMRH_FSTAT_CCIF_MASK
#define FTMRx_FSTAT_ACCERR_MASK    FTMRH_FSTAT_ACCERR_MASK
#define FTMRx_FSTAT_FPVIOL_MASK    FTMRH_FSTAT_FPVIOL_MASK
#define FTMRx_FSTAT_MGBUSY_MASK    FTMRH_FSTAT_MGBUSY_MASK
#define FTMRx_FSTAT_MGSTAT_MASK    FTMRH_FSTAT_MGSTAT_MASK
#define FTMRx_FSTAT_MGSTAT0_MASK   FTMRH_FSTAT_MGSTAT(1U)
#define FTMRx_FSTAT_MGSTAT1_MASK   FTMRH_FSTAT_MGSTAT(2U)
#define FTMRx_FSEC_SEC_MASK        FTMRH_FSEC_SEC_MASK
#define FTMRx_FSEC_KEYEN_MASK      FTMRH_FSEC_KEYEN_MASK
#if defined(FTMRH_FPROT_FPHDIS_MASK)
#define FTMRx_FPROT_FPHDIS_MASK FTMRH_FPROT_FPHDIS_MASK
#endif
#if defined(FTMRH_FERSTAT_SFDIF_MASK)
#define FTMRx_FERSTAT_SFDIF_MASK FTMRH_FERSTAT_SFDIF_MASK
#define FTMRx_FERSTAT_DFDIF_MASK FTMRH_FERSTAT_DFDIF_MASK
#endif
#else
#error "Unknown flash controller"
#endif
/*@}*/

/*!
 * @brief Enumeration for flash config area.
 */
enum _flash_config_area_range
{
    kFLASH_ConfigAreaStart = 0x400UL,
    kFLASH_ConfigAreaEnd   = 0x40FUL
};

/*!
 * @name Flash register access type defines
 * @{
 */
#define FTMRx_REG8_ACCESS_TYPE  volatile uint8_t *
#define FTMRx_REG32_ACCESS_TYPE volatile uint32_t *
/*@}*/

/*!
 * @brief MCM cache register access info defines.
 */
#if defined(MCM_PLACR_CFCC_MASK)
#define MCM_CACHE_CLEAR_MASK  MCM_PLACR_CFCC_MASK
#define MCM_CACHE_CLEAR_SHIFT MCM_PLACR_CFCC_SHIFT
#if defined(MCM)
#define MCM0_CACHE_REG MCM->PLACR
#elif defined(MCM0)
#define MCM0_CACHE_REG MCM0->PLACR
#endif
#if defined(MCM1)
#define MCM1_CACHE_REG MCM1->PLACR
#endif
#elif defined(MCM_CPCR2_CCBC_MASK)
#define MCM_CACHE_CLEAR_MASK  MCM_CPCR2_CCBC_MASK
#define MCM_CACHE_CLEAR_SHIFT MCM_CPCR2_CCBC_SHIFT
#if defined(MCM)
#define MCM0_CACHE_REG MCM->CPCR2
#elif defined(MCM0)
#define MCM0_CACHE_REG MCM0->CPCR2
#endif
#if defined(MCM1)
#define MCM1_CACHE_REG MCM1->CPCR2
#endif
#endif

