Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_flash.c
/*******************************************************************************
 * Code
 ******************************************************************************/

/*!
 * brief Initializes the global flash properties structure members.
 *
 * This function checks and initializes the Flash module for the other Flash
 * APIs.
 *
 * param config Pointer to the storage for the driver runtime state.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_ClockDivider Flash clock prescaler is wrong.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 */
status_t FLASH_Init(flash_config_t *config)
{
    status_t returnCode;
    uint8_t clkDiver;

    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }
    clkDiver = (uint8_t)(config->PFlashClockFreq / 1000000UL - 1UL);

    /* Initialize the flash clock to be within spec 1MHz. */
    if ((0U == (FTMRx->FCLKDIV & FTMRx_FCLKDIV_FDIVLCK_MASK)) && (0U != (FTMRx->FSTAT & FTMRx_FSTAT_CCIF_MASK)))
    {
        /* FCLKDIV register is not locked.*/
        FTMRx->FCLKDIV = (uint8_t)(FTMRx->FCLKDIV & (~FTMRx_FCLKDIV_FDIV_MASK)) | FTMRx_FCLKDIV_FDIV(clkDiver);
        if ((FTMRx->FCLKDIV & FTMRx_FCLKDIV_FDIV_MASK) != FTMRx_FCLKDIV_FDIV(clkDiver))
        {
            return kStatus_FLASH_ClockDivider;
        }
    }
    else
    {
        /* FCLKDIV register is locked. */
        if ((FTMRx->FCLKDIV & FTMRx_FCLKDIV_FDIV_MASK) != FTMRx_FCLKDIV_FDIV(clkDiver))
        {
            return kStatus_FLASH_ClockDivider;
        }
    }
#if FLASH_SSD_IS_SECONDARY_FLASH_ENABLED
    if (config->FlashMemoryIndex == (uint8_t)kFLASH_MemoryIndexSecondaryFlash)
    {
        config->PFlashBlockBase = SECONDARY_FLASH_FEATURE_PFLASH_START_ADDRESS;
        config->PFlashTotalSize =
            SECONDARY_FLASH_FEATURE_PFLASH_BLOCK_COUNT * SECONDARY_FLASH_FEATURE_PFLASH_BLOCK_SIZE;
        config->PFlashBlockCount = SECONDARY_FLASH_FEATURE_PFLASH_BLOCK_COUNT;
        config->PFlashSectorSize = SECONDARY_FLASH_FEATURE_PFLASH_BLOCK_SECTOR_SIZE;
    }
    else
#endif
    {
        /* fill out a few of the structure members */
        config->PFlashBlockBase  = FSL_FEATURE_FLASH_PFLASH_START_ADDRESS;
        config->PFlashTotalSize  = FSL_FEATURE_FLASH_PFLASH_BLOCK_COUNT * FSL_FEATURE_FLASH_PFLASH_BLOCK_SIZE;
        config->PFlashBlockCount = FSL_FEATURE_FLASH_PFLASH_BLOCK_COUNT;
        config->PFlashSectorSize = FSL_FEATURE_FLASH_PFLASH_BLOCK_SECTOR_SIZE;
    }
    config->PFlashCallback = NULL;

/* copy required flash commands to RAM */
#if (FLASH_DRIVER_IS_FLASH_RESIDENT && !FLASH_DRIVER_IS_EXPORTED)
    if (kStatus_FLASH_Success != flash_check_execute_in_ram_function_info(config))
    {
        config->executeInRamFunction.activeFunctionCount                     = 0UL;
        config->executeInRamFunction.runCmdFuncAddr.commadAddr               = (uint32_t)s_flashRunCommand;
        config->executeInRamFunction.CommonBitOperationAddr.bitOperationAddr = (uint32_t)s_flashCommonBitOperation;
        config->flashExecuteInRamFunctionInfo = &config->executeInRamFunction.activeFunctionCount;
        returnCode                            = FLASH_PrepareExecuteInRamFunctions(config);
        if (returnCode != kStatus_FLASH_Success)
        {
            return returnCode;
        }
    }
#endif
#if FLASH_SSD_IS_EEPROM_ENABLED
    config->EEpromBlockBase  = FSL_FEATURE_FLASH_EEPROM_START_ADDRESS;
    config->EEpromBlockCount = FSL_FEATURE_FLASH_EEPROM_BLOCK_COUNT;
    config->EEpromTotalSize  = FSL_FEATURE_FLASH_EEPROM_BLOCK_SIZE * FSL_FEATURE_FLASH_EEPROM_BLOCK_COUNT;
    config->EEpromSectorSize = FSL_FEATURE_FLASH_EEPROM_BLOCK_SECTOR_SIZE;
#endif
    config->PFlashMarginLevel = (uint32_t)kFLASH_MarginValueNormal;

    return kStatus_FLASH_Success;
}

/*!
 * brief Sets the desired flash callback function.
 *
 * param config Pointer to the storage for the driver runtime state.
 * param callback A callback function to be stored in the driver.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 */
status_t FLASH_SetCallback(flash_config_t *config, flash_callback_t callback)
{
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    config->PFlashCallback = callback;

    return kStatus_FLASH_Success;
}

#if defined(FLASH_DRIVER_IS_FLASH_RESIDENT) && FLASH_DRIVER_IS_FLASH_RESIDENT
status_t FLASH_PrepareExecuteInRamFunctions(flash_config_t *config)
{
    flash_execute_in_ram_function_config_t *flashExecuteInRamFunctionInfo = &config->executeInRamFunction;

    if ((config == NULL) || (config->flashExecuteInRamFunctionInfo == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }
    /* copy flash run command to ram*/
    copy_flash_run_command(config);

    /* copy flash common bit operation command to ram*/
    copy_flash_common_bit_operation(config);
    flashExecuteInRamFunctionInfo->activeFunctionCount = kFLASH_ExecuteInRamFunctionTotalNum;

    return kStatus_FLASH_Success;
}
#endif /* FLASH_DRIVER_IS_FLASH_RESIDENT */

/*!
 * brief Erases entire flash
 *
 * param config Pointer to the storage for the driver runtime state.
 * param key A value used to validate all flash erase APIs.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_EraseKeyError API erase key is invalid.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during command execution.
 * retval #kStatus_FLASH_EepromSingleBitFault EEPROM single bit fault error
 * code.
 * retval #kStatus_FLASH_EepromDoubleBitFault EEPROM double bit fault error
 * code.
 */
status_t FLASH_EraseAll(flash_config_t *config, uint32_t key)
{
    status_t returnCode;

    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

