Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_flash.c
    nextBlockStartAddress = ALIGN_UP(start, blockSize);
    if (nextBlockStartAddress == start)
    {
        nextBlockStartAddress += blockSize;
    }

    remainingBytes = lengthInBytes;

    while (remainingBytes != 0UL)
    {
        uint32_t numberOfPhrases;
        uint32_t verifyLength = nextBlockStartAddress - start;
        if (verifyLength > remainingBytes)
        {
            verifyLength = remainingBytes;
        }
        numberOfPhrases = verifyLength >> flashOperationInfo.sectionCmdAddressAligment;
        if ((uint32_t)margin != config->PFlashMarginLevel)
        {
            switch (margin)
            {
                case kFLASH_MarginValueUser:
                    returnCode = flash_setusermarginlevel(config, start, 0U, kFLASH_UserMarginValue1);
                    break;
                case kFLASH_MarginValueFactory:
                    returnCode = flash_setfactorymarginlevel(config, start, 0U, kFLASH_FactoryMarginValue1);
                    break;
                case kFLASH_MarginValueNormal:
                    returnCode = flash_setusermarginlevel(config, start, 0U, kFLASH_ReadMarginValueNormal);
                    break;
                default:
                    returnCode = kStatus_FLASH_InvalidArgument;
                    break;
            }
            config->PFlashMarginLevel = (uint32_t)margin;
        }
        if (kStatus_FLASH_Success != returnCode)
        {
            return returnCode;
        }
        flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Fill in verify FLASH section command parameters. */
        flash_set_command(0UL, start >> 16UL, FTMRx_ERASE_VERIFY_SECTION);
        flash_set_command(1UL, start, start >> 8UL);
        /* Write index to specify the # of longwords to be verified */
        flash_set_command(2UL, numberOfPhrases, numberOfPhrases >> 8UL);

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);
        if (kStatus_FLASH_Success != returnCode)
        {
            return returnCode;
        }

        remainingBytes -= verifyLength;
        start += verifyLength;
        nextBlockStartAddress += blockSize;
    }

    return kStatus_FLASH_Success;
}

/*!
 * brief Returns the protection state of the desired flash area via the pointer
 * passed into the function.
 *
 * This function retrieves the current flash protect status for a given
 * flash area as determined by the start address and length.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param start The start address of the desired flash memory to be checked. Must
 * be word-aligned.
 * param lengthInBytes The length, given in bytes (not words or long-words)
 *        to be checked.  Must be word-aligned.
 * param protection_state A pointer to the value returned for the current
 *        protection status code for the desired flash area.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_AlignmentError Parameter is not aligned with specified
 * baseline.
 * retval #kStatus_FLASH_AddressError The address is out of range.
 */
status_t FLASH_IsProtected(flash_config_t *config,
                           uint32_t start,
                           uint32_t lengthInBytes,
                           flash_protection_state_t *protection_state)
{
    flash_protection_config_t flashProtectionInfo; /* flash protection information */
    uint32_t endAddress;                           /* end address for protection check */
    status_t returnCode;

    if ((protection_state == NULL) || (lengthInBytes == 0UL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Check the supplied address range. */
    returnCode = flash_check_range(config, start, lengthInBytes, FSL_FEATURE_FLASH_PFLASH_BLOCK_WRITE_UNIT_SIZE);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    /* Get necessary flash protection information. */
    returnCode = flash_get_protection_info(config, &flashProtectionInfo);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    /* calculating Flash end address */
    endAddress = start + lengthInBytes;

    if (((start >= flashProtectionInfo.lowRegionStart) && (endAddress <= flashProtectionInfo.lowRegionEnd)) ||
        ((start >= flashProtectionInfo.highRegionStart) && (endAddress <= flashProtectionInfo.highRegionEnd)))
    {
        *protection_state = kFLASH_ProtectionStateProtected;
    }
    else if (((start >= flashProtectionInfo.lowRegionEnd) && (endAddress <= flashProtectionInfo.highRegionStart)) ||
             (start >= flashProtectionInfo.highRegionEnd) || (endAddress <= flashProtectionInfo.lowRegionStart))
    {
        *protection_state = kFLASH_ProtectionStateUnprotected;
    }
    else
    {
        *protection_state = kFLASH_ProtectionStateMixed;
    }

    return kStatus_FLASH_Success;
}

/*!
 * brief Returns the desired flash property.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param whichProperty The desired property from the list of properties in
 *        enum flash_property_tag_t
 * param value A pointer to the value returned for the desired flash property.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_UnknownProperty An unknown property tag.
 */
status_t FLASH_GetProperty(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t *value)
{
    status_t status = kStatus_FLASH_UnknownProperty;
    if ((config == NULL) || (value == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    switch (whichProperty)
    {
        case kFLASH_PropertyPflashSectorSize:
            *value = config->PFlashSectorSize;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyPflashTotalSize:
            *value = config->PFlashTotalSize;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyPflashBlockSize:
            *value = config->PFlashTotalSize / (uint32_t)config->PFlashBlockCount;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyPflashBlockCount:
            *value = (uint32_t)config->PFlashBlockCount;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyPflashBlockBaseAddr:
            *value = config->PFlashBlockBase;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyPflashFacSupport:
#if defined(FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL)
            *value = FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL;
#else
            *value = 0UL;
#endif /* FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL */
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyFlashClockFrequency:
            *value = config->PFlashClockFreq;
            status = kStatus_FLASH_Success;
            break;

