Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_flash.c
#if FLASH_SSD_IS_EEPROM_ENABLED
        case kFLASH_PropertyEepromBlockBaseAddr:
            *value = config->EEpromBlockBase;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyEepromTotalSize:
            *value = config->EEpromTotalSize;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyEepromSectorSize:
            *value = (uint32_t)config->EEpromSectorSize;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyEepromBlockSize:
            *value = config->EEpromTotalSize / (uint32_t)config->EEpromBlockCount;
            status = kStatus_FLASH_Success;
            break;

        case kFLASH_PropertyEepromBlockCount:
            *value = (uint32_t)config->EEpromBlockCount;
            status = kStatus_FLASH_Success;
            break;
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */

        default: /* catch inputs that are not recognized */
            status = kStatus_FLASH_UnknownProperty;
            break;
    }

    return status;
}

/*!
 * brief Sets the desired flash property.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param whichProperty The desired property from the list of properties in
 *        enum flash_property_tag_t
 * param value A to set for the desired flash property.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_UnknownProperty An unknown property tag.
 * retval #kStatus_FLASH_InvalidPropertyValue An invalid property value.
 * retval #kStatus_FLASH_ReadOnlyProperty An read-only property tag.
 */
status_t FLASH_SetProperty(flash_config_t *config, flash_property_tag_t whichProperty, uint32_t value)
{
    status_t status = kStatus_FLASH_Success;

    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    switch (whichProperty)
    {
#if FLASH_SSD_IS_SECONDARY_FLASH_ENABLED
        case kFLASH_PropertyFlashMemoryIndex:
            if ((value != (uint32_t)kFLASH_MemoryIndexPrimaryFlash) &&
                (value != (uint32_t)kFLASH_MemoryIndexSecondaryFlash))
            {
                return kStatus_FLASH_InvalidPropertyValue;
            }
            config->FlashMemoryIndex = (uint8_t)value;
            break;
#endif /* FLASH_SSD_IS_SECONDARY_FLASH_ENABLED */

        case kFLASH_PropertyFlashCacheControllerIndex:
            if ((value != (uint32_t)kFLASH_CacheControllerIndexForCore0) &&
                (value != (uint32_t)kFLASH_CacheControllerIndexForCore1))
            {
                return kStatus_FLASH_InvalidPropertyValue;
            }
            config->FlashCacheControllerIndex = (uint8_t)value;
            break;
        case kFLASH_PropertyFlashClockFrequency:
            config->PFlashClockFreq = value;
            break;
        case kFLASH_PropertyPflashSectorSize:
        case kFLASH_PropertyPflashTotalSize:
        case kFLASH_PropertyPflashBlockSize:
        case kFLASH_PropertyPflashBlockCount:
        case kFLASH_PropertyPflashBlockBaseAddr:
        case kFLASH_PropertyPflashFacSupport:
#if FLASH_SSD_IS_EEPROM_ENABLED
        case kFLASH_PropertyEepromBlockBaseAddr:
        case kFLASH_PropertyEepromTotalSize:
        case kFLASH_PropertyEepromSectorSize:
        case kFLASH_PropertyEepromBlockSize:
        case kFLASH_PropertyEepromBlockCount:
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */
            status = kStatus_FLASH_ReadOnlyProperty;
            break;
        default: /* catch inputs that are not recognized */
            status = kStatus_FLASH_UnknownProperty;
            break;
    }

    return status;
}

/*!
 * brief Sets the PFlash Protection to the intended protection status.
 *
 * param config A pointer to storage for the driver runtime state.
 * param protectStatus The expected protect status to set to the PFlash
 * protection register.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_CommandFailure Run-time error during command execution.
 */
status_t FLASH_PflashSetProtection(flash_config_t *config, pflash_protection_status_t *protectStatus)
{
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }
    /* The reserved bit6 value of FPROT is reset value, which cannot change.
     * If flash memory is only 8KB, the bit3 to bit5 of FPROT are also reserved.*/
    FTMRx->FPROT = protectStatus->fprotvalue;
    if (protectStatus->fprotvalue != FTMRx->FPROT)
    {
        return kStatus_FLASH_CommandFailure;
    }

    return kStatus_FLASH_Success;
}

/*!
 * brief Gets the PFlash protection status.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param protectStatus  Protect status returned by the PFlash IP.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 */
status_t FLASH_PflashGetProtection(flash_config_t *config, pflash_protection_status_t *protectStatus)
{
    if ((config == NULL) || (protectStatus == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    protectStatus->fprotvalue = FTMRx->FPROT;

    return kStatus_FLASH_Success;
}

#if defined(FLASH_SSD_IS_EEPROM_ENABLED) && FLASH_SSD_IS_EEPROM_ENABLED
status_t FLASH_EepromSetProtection(flash_config_t *config, uint8_t protectStatus)
{
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    if ((config->EEpromTotalSize == 0UL) || (config->EEpromTotalSize == NVM_EEPROM_SIZE_FOR_EEESIZE_RESERVED))
    {
        return kStatus_FLASH_CommandNotSupported;
    }

    FTMRx->EEPROT = protectStatus;

    if (FTMRx->EEPROT != protectStatus)
    {
        return kStatus_FLASH_CommandFailure;
    }

    return kStatus_FLASH_Success;
}
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */

#if defined(FLASH_SSD_IS_EEPROM_ENABLED) && FLASH_SSD_IS_EEPROM_ENABLED
status_t FLASH_EepromGetProtection(flash_config_t *config, uint8_t *protectStatus)
{
    if ((config == NULL) || (protectStatus == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    if ((config->EEpromTotalSize == 0UL) || (config->EEpromTotalSize == NVM_EEPROM_SIZE_FOR_EEESIZE_RESERVED))
    {
        return kStatus_FLASH_CommandNotSupported;
    }

    *protectStatus = FTMRx->EEPROT;

