Masmiseim36/nxpSDK/devices/MKE06Z4/drivers/fsl_flash.c
    /* Clean up info Structure*/
    (void)memset(info, 0, sizeof(flash_protection_config_t));

/* Note: KW40 has a secondary flash, but it doesn't have independent protection
 * register*/
#if FLASH_SSD_IS_SECONDARY_FLASH_ENABLED && (!FLASH_SSD_SECONDARY_FLASH_HAS_ITS_OWN_PROTECTION_REGISTER)
    pflashTotalSize = FSL_FEATURE_FLASH_PFLASH_BLOCK_COUNT * FSL_FEATURE_FLASH_PFLASH_BLOCK_SIZE +
                      FSL_FEATURE_FLASH_PFLASH_1_BLOCK_COUNT * FSL_FEATURE_FLASH_PFLASH_1_BLOCK_SIZE;
    regionBase = FSL_FEATURE_FLASH_PFLASH_START_ADDRESS;
#else
    pflashTotalSize = config->PFlashTotalSize;
    regionBase = config->PFlashBlockBase;
#endif

    /* Calculate the flash protection region */
    pflashProtectionValue = FTMRx->FPROT & 0xA4UL;
    pflashFPLS            = (FTMRx->FPROT & 0x03UL);
#if defined(FTMRx_FPROT_FPHDIS_MASK)
    pflashFPHS = (FTMRx->FPROT & 0x18UL) >> 3UL;
#endif

    switch (pflashProtectionValue)
    {
#if defined(FTMRx_FPROT_FPHDIS_MASK)
        case 0xA4UL:
            /*!< All flash region is not protected.*/
            info->lowRegionStart  = regionBase;
            info->lowRegionEnd    = regionBase;
            info->highRegionStart = regionBase + pflashTotalSize;
            info->highRegionEnd   = regionBase + pflashTotalSize;
            break;
#endif
        case 0x84UL:
            info->lowRegionStart = regionBase;
            info->lowRegionEnd   = regionBase;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
            /*!< Only flash high region is protected.*/
            info->highRegionStart =
                (uint32_t)FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS - ((1UL << pflashFPLS) << 10UL);
            info->highRegionEnd = FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS;
#else
            /*!< All flash region is not protected.*/
            info->highRegionStart = regionBase + pflashTotalSize;
            info->highRegionEnd = regionBase + pflashTotalSize;
#endif
            break;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
        case 0xA0UL:
            /*!< Only flash low region is protected.*/
            info->lowRegionStart  = regionBase;
            info->lowRegionEnd    = regionBase + ((2UL << pflashFPLS) << 10UL);
            info->highRegionStart = regionBase + pflashTotalSize;
            info->highRegionEnd   = regionBase + pflashTotalSize;
            break;
#endif
        case 0x80UL:
            info->lowRegionStart = regionBase;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
            /*!< Flash high and low region are protected.*/
            info->lowRegionEnd = regionBase + ((2UL << pflashFPLS) << 10UL);
            info->highRegionStart =
                (uint32_t)FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS - ((1UL << pflashFPLS) << 10UL);
            info->highRegionEnd = FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS;
#else
            /*!< Only flash low region is protected.*/
            info->lowRegionEnd = regionBase + ((1UL << pflashFPLS) << 10UL);
            info->highRegionStart = regionBase + pflashTotalSize;
            info->highRegionEnd = regionBase + pflashTotalSize;
#endif
            break;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
        case 0x24UL:
            /*!< All Flash region is protected.*/
            info->lowRegionStart  = regionBase;
            info->lowRegionEnd    = regionBase + pflashTotalSize;
            info->highRegionStart = regionBase;
            info->highRegionEnd   = regionBase + pflashTotalSize;
            break;
#endif
        case 0x04UL:
            info->lowRegionStart = regionBase;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
            /*!< Flash high region is not protected.*/
            info->lowRegionEnd = (uint32_t)FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS - ((1UL << pflashFPHS) << 10UL);
            info->highRegionStart = FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS;

#else
            /*!< All Flash region is protected.*/
            info->lowRegionEnd = regionBase + pflashTotalSize;
            info->highRegionStart = regionBase;
#endif
            info->highRegionEnd = regionBase + pflashTotalSize;
            break;
#if defined(FTMRx_FPROT_FPHDIS_MASK)
        case 0x20UL:
            /*!< Flash low region is not protected.*/
            info->lowRegionStart  = regionBase + ((2UL << pflashFPLS) << 10UL);
            info->lowRegionEnd    = regionBase + pflashTotalSize;
            info->highRegionStart = regionBase + ((2UL << pflashFPLS) << 10UL);
            info->highRegionEnd   = regionBase + pflashTotalSize;
            break;
#endif
        case 0x00UL:
#if defined(FTMRx_FPROT_FPHDIS_MASK)
            /*!< Flash high and low region are not protected.*/
            info->lowRegionStart = regionBase + ((2UL << pflashFPLS) << 10UL);
            info->lowRegionEnd = (uint32_t)FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS - ((1UL << pflashFPHS) << 10UL);
            info->highRegionStart = FSL_FEATURE_FLASH_PFLASH_HIGH_START_ADDRESS;
#else
            /*!< Flash low region is not protected.*/
            info->lowRegionStart = regionBase;
            info->lowRegionEnd = regionBase;
            info->highRegionStart = regionBase + ((1UL << pflashFPLS) << 10UL);
#endif
            info->highRegionEnd = regionBase + pflashTotalSize;
            break;
        default:
            /* Do Nothing*/
            break;
    }

    return kStatus_FLASH_Success;
}

/*! @brief Set the flash and eeprom to the specified user margin level.*/
status_t flash_setusermarginlevel(flash_config_t *config,
                                  uint32_t start,
                                  uint8_t iseeprom,
                                  flash_user_margin_value_t margin)
{
    uint32_t marginValue;
    status_t returnCode;
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }
    marginValue = (uint32_t)margin;
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0UL, start >> 16UL, FTMRx_SET_USER_MARGIN_LEVEL);

    /* memory address bits[23:16] with bit23 = 0 for Flash block, 1 for EEPROM
     * block */
    if (0UL != iseeprom)
    {
        FTMRx->FCCOBLO |= FTMRx_FCCOBLO_CCOB(128UL);
    }
    flash_set_command(1UL, start, start >> 8UL);

    flash_set_command(2UL, marginValue, marginValue >> 8UL);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);
    return returnCode;
}

/*! @brief Set the flash and eeprom to the specified factory margin level.*/
status_t flash_setfactorymarginlevel(flash_config_t *config,
                                     uint32_t start,
                                     uint8_t iseeprom,
                                     flash_factory_margin_value_t margin)
{
    uint32_t marginValue;
    status_t returnCode;
    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    marginValue = (uint32_t)margin;
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);
    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0UL, start >> 16UL, FTMRx_SET_FACTORY_MARGIN_LEVEL);
    /* memory address bits[23:16] with bit23 = 0 for Flash block, 1 for EEPROM
     * block */
    if (0UL != iseeprom)
    {
        FTMRx->FCCOBLO |= FTMRx_FCCOBLO_CCOB(128UL);
    }
    flash_set_command(1UL, start, start >> 8UL);

    flash_set_command(2UL, marginValue, marginValue >> 8UL);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);
    return returnCode;
}
